{
  "name": "vTable",
  "props": {
    "base": "",
    "variant": "",
    "definition": "Table definition is an optional `array` of `objects` that defines look and behavior of the table. <a href='#table-definition' class='link'>See details below.</a>",
    "items": "Data to display in table. Each element of Array is an Object. Single Object is one record (row) of data",
    "filter": "Use this String to filter items. Filtering always emits update:page with value 1 and resets any active selection",
    "page": "Current page number. Changing page resets current selection",
    "itemsPerPage": "Number of records (rows) on single page. Setting it to `0` disables pagination",
    "noHeader": "If `true` does not display table headers",
    "primaryKey": "This props should be name of the property that is unique for every record. It is used as value for `key` attribute",
    "captionTop": "If `true` display caption on top",
    "emptyText": "Text displayed if table is empty",
    "emptyFilteredText": "Text displayed if table is empty after filtering out all items",
    "locale": "Locale used to compare and sort strings",
    "selectionMode": "Enables or disables selection of rows. Valid values are 'single' (allows selection of single row only), 'multiple' (allows multiple rows to be selected) or `empty string` (disables selection). After new row is selected or unselected event input:selection is emmited with array of all selected records. Filtering, sorting, changing current page or modifying selection-mode prop resets current selection by emmiting empty array",
    "state": "State of table. Valid values are 'busy' or `empty string`. Busy state disables pointer events on table and renders contents of `busy` slot instead of table rows",
    "styleTable": "Main table element",
    "styleHeaderRow": "Header row",
    "styleHeaderCell": "Header cell",
    "styleRow": "Table row",
    "styleCell": "Table cell",
    "styleCaption": "Table caption."
  },
  "emits": {
    "update:page": "Emmited after filtering. Useful for updating pagination",
    "update:filtered-count": "Emmited after filtering. Useful for updating pagination",
    "input:selection": "Emmited after selecting rows. Event data contains array of selected records"
  },
  "slots": {
    "caption": "Slot for caption text. Position caption using `caption-top` prop",
    "busy": "Content of this slot replaces data records if table is `busy`",
    "empty-table-message": "Slot for custom empty table message when `items` prop is empty table",
    "empty-filtered-table-message": "Slot for custom empty filtered table message when table is empty after filtering",
    "cell:[key]": "Slot for cell content. Useful for adding some html formatting, transforming value etc. Key is one of the keys of data record or additional key from definition array. Slot props: `value`, `item`",
    "colspan": ""
  },
  "functions": {},
  "components": {}
}
