{
  "name": "vTable",
  "props": {
    "base": "",
    "variant": "",
    "definition": "Table definition is an optional `array` of `objects` that defines look and behavior of the table. <a href='#table-definition' class='link'>See details below.</a>",
    "items": "Data to display in the table. Each element of an `array` is an `object`. Single `object` is one record (row) of the data",
    "filter": "Use this string to filter items. Filtering always emits the update:page with value 1 and resets any active selection",
    "page": "Current page number. Changing the page resets current selection",
    "itemsPerPage": "Number of records (rows) on the single page. Setting it to the `0` disables pagination",
    "noHeader": "If `true` does not display table headers",
    "primaryKey": "This props should be the name of the property that is unique for every record. It is used as value for `key` attribute",
    "captionTop": "If `true` display caption on the top",
    "emptyText": "Text displayed if the table is empty",
    "emptyFilteredText": "Text displayed if the table is empty after filtering out all items",
    "locale": "Locale used to compare and sort strings",
    "selectionMode": "Enables or disables selection of the rows. Valid values are: 'single' (allows selection of single row only), 'multiple' (allows multiple rows to be selected) or `empty string` (disables selection). After new row is selected or unselected the input:selection event is emmited with an array of all selected records. Filtering, sorting, changing current page or modifying selection-mode prop resets current selection by emmiting an empty array",
    "state": "State of the table. Valid values are: 'busy' or `empty string`. Busy state disables pointer events on the table and renders contents of the `busy` slot instead of table rows",
    "modTable": "Style of the main table element",
    "modHeaderRow": "Style of the header row element",
    "modHeaderCell": "Style of the single header cell element",
    "modRow": "Style of the table row element",
    "modCell": "Style of the single table cell",
    "modCaption": "Style of the table caption"
  },
  "emits": {
    "update:page": "Emmited after filtering. Useful for updating pagination",
    "update:filtered-count": "Emmited after filtering. Useful for updating pagination",
    "input:selection": "Emmited after selecting rows. Event data contains an array of selected records"
  },
  "slots": {
    "caption": "Slot for the caption text. Position the caption using the `caption-top` prop",
    "busy": "Content of this slot replaces data records if the table is in the `busy` state",
    "empty-table-message": "Slot for the custom empty table message when the `items` prop is empty table",
    "empty-filtered-table-message": "Slot for the custom empty filtered table message when the table is empty after filtering",
    "cell:[key]": "Slot for the cells content. Useful for adding some html formatting, transforming value etc. Key is one of the keys of data record or additional key from the definition array. Slot props: `value`, `item`",
    "colspan": ""
  },
  "functions": {},
  "components": {}
}
