{
  "name": "vTree",
  "props": {
    "base": "",
    "variant": "",
    "items": "Array of the tree items",
    "itemName": "Name of the property that hold the name of item",
    "itemChildren": "Name of the property that hold the name of array of children",
    "itemIcon": "Name of the property that hold the name of the item's icon. Valid name is the same as for the v-icon name prop",
    "itemDisabled": "Name of the property for the disabled items. Disabling folder also disable all of its children",
    "itemKey": "Name of the required property that hold unique value for every item.",
    "filter": "String used to filter items",
    "autoOpenRoot": "If `true` mounts tree with the root node open",
    "autoOpenAll": "If `true` mounts tree with all nodes open",
    "selectReturnKeys": "If `true` the @input:selected event returns an `array` of item keys. If `false` (default) this event returns an `array` of the item `objects`",
    "selectIndependent": "If `true` folders and items can be selected independently. By default selecting a folder selects all of its children items and selecting every children selects the parent folder",
    "openOnClick": "If `true` clicking on the label opens folder. Clicking an indicator always opens folders",
    "allowSelectDisabled": "If `true` disabled items can be selected",
    "allowOpenDisabled": "If `true` disabled folders items can be opened",
    "showCheckboxes": "Displays checkboxes",
    "showIcons": "Displays icons if the icon or placeholder icon is set",
    "showIndicators": "Displays open indicators",
    "placeholderItemIcon": "Default icon for the items if no icon is provided in the `items` prop",
    "placeholderFolderIcon": "Default icon for the folders if no icon is provided in the items prop. If value is the `array` then the icons are respectively for the close and open folders",
    "chevron": "Attributes of the v-chevron (open indicator) component. See the documentation for the valid values",
    "transition": "Sets the animation effect when opening or closing folders. Valid values are: 'fade', 'fade-slide', or `empty string` to disable animations.",
    "modFolder": "Style of the folder element",
    "modItem": "Style of the item element",
    "modIcon": "Style of the icon element"
  },
  "emits": {
    "input:selected": "Fired when an item is selected. Passes an array of the selected items",
    "input:click": "Fired when an item is clicked"
  },
  "slots": {
    "item": "Slot for the complete customization of appearance of the items. Other slots are unavailable when using this slot",
    "icon": "Slot for the items icon",
    "item-prepend": "Slot for the content that prepends item name",
    "name": "Slot for the items name",
    "item-append": "Slot for the content that is appended to the item name"
  },
  "functions": {
    "openAllLevel(level: Number)": "Opens all nodes on the level (0 for the root, any high number to open all nodes)",
    "closeAll()": "Closes all nodes"
  },
  "components": {}
}
